src/config/DataProcessors/РассылкаНакладныхКлиентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>РассылкаНакладныхКлиентам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флажок1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флажок2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Флажок3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокМенеджеров</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УЗНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АдресаКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОтправкаПоПочте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлектронныйАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Реализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/config/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КонтрагентДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоДляОграниченияПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьВТерминал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеЛогистики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ПунктыВыдачи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/СчетФактураВыданный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>СчетФактураВыданный</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСПокупки</xr:Item>
				<xr:Item>AccumulationRegister.НДСПродажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаАванс</Name>
					<Comment>Признак счет-фактуры на аванс</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Под0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/DataProcessors/РассылкаНакладныхКлиентам/Ext/ObjectModule.bsl
Перем ТекстСообщения0;

Процедура Сформировать() Экспорт	
// сформироватьФайлы
	
	АдресаКонтрагентов.Очистить();
	Реализации.Очистить();
	//в бухгалтерии - нет ограничений по менеджерам
	//Если СписокМенеджеров.Количество()>0 тогда
	//	СписокКонтрагентовМенеджера = ПолучитьСписокКонтрагентовМенеджера(СписокМенеджеров);
	//иначе				
	//	СписокКонтрагентовМенеджера = новый СписокЗначений;
	//КонецЕсли;	
	
	ЗапросКонтрагенты=Новый Запрос;
	ЗапросКонтрагенты.Текст="ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(1000))) = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТребуетсяОтправкаПоПочте,
	|	А.Контрагент КАК КОнтрагент,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ЭлектронныйАдрес
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РеализацияТоваровУслуг.Контрагент КАК Контрагент
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	|"+?(СписокМенеджеров.Количество()>0, " И РеализацияТоваровУслуг.Ответственный в (&СписокМенеджеров) ","")+"
	|		И НЕ РеализацияТоваровУслуг.Номер ПОДОБНО &ПризнакПени
	|		И НЕ РеализацияТоваровУслуг.ДоговорКонтрагента.Наименование ПОДОБНО ""%*%""
	|		И РеализацияТоваровУслуг.Проведен) КАК А
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтактнаяИнформация.Объект КАК Объект,
	|			КонтактнаяИнформация.Представление КАК Представление
	|		ИЗ
	|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ГДЕ
	|			КонтактнаяИнформация.Тип = &Тип
	|			И КонтактнаяИнформация.Вид = &Вид) КАК КонтактнаяИнформация
	|		ПО А.Контрагент = КонтактнаяИнформация.Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТребуетсяОтправкаПоПочте УБЫВ,
	|	КОнтрагент
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Если Флажок1 Тогда
		ЗапросКонтрагенты.Текст = СтрЗаменить(ЗапросКонтрагенты.Текст,"И НЕ РеализацияТоваровУслуг.Номер ПОДОБНО &ПризнакПени","И РеализацияТоваровУслуг.Номер ПОДОБНО &ПризнакПени");
	КонецЕсли;
	ЗапросКонтрагенты.УстановитьПараметр("СписокМенеджеров",СписокМенеджеров);
	ЗапросКонтрагенты.УстановитьПараметр("НачДата",НачДата);
	ЗапросКонтрагенты.УстановитьПараметр("КонДата",КонецДня(КонДата));
	ЗапросКонтрагенты.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ЗапросКонтрагенты.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("00013")); //+++ Адрес электронной почты для обмена документами
	ЗапросКонтрагенты.УстановитьПараметр("ПризнакПени","%ПЕ%"); 
	
	//+++ если несколько эл.адресов у 1 контрагента - то через запятую
	//Выборка=ЗапросКонтрагенты.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока Выборка.Следующий() Цикл
	//	СтрокаАдрес=АдресаКонтрагентов.Добавить();	
	//	СтрокаАдрес.Контрагент = Выборка.Контрагент;
	//	//ЗаполнитьЗначенияСвойств(СтрокаАдрес,Выборка);
	//	выборкаЭлАдресов = Выборка.Выбрать();
	//	стрЭлАресов = "";
	//	Пока выборкаЭлАдресов.Следующий() Цикл
	//		стрЭлАресов =стрЭлАресов +?(стрЭлАресов = "", "", ", ")+ выборкаЭлАдресов.ЭлектронныйАдрес;
	//	КонецЦикла;
	//	СтрокаАдрес.ЭлектронныйАдрес =  стрЭлАресов;
	//КонецЦикла;	
	АдресаКонтрагентов.Очистить();
	АдресаКонтрагентов.Загрузить( ЗапросКонтрагенты.Выполнить().Выгрузить() );
	
	
	//------------------------------------------------------------------------------	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Истина как Выбран,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ЕСТЬNULL(СчетФактураВыданный.Ссылка, """") КАК ЗаказПокупателя
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		"+?(ВсеРеализации, "ЛЕВОЕ", "Правое")+" СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование)
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	|		И НЕ РеализацияТоваровУслуг.Номер ПОДОБНО &ПризнакПени
	|		И НЕ РеализацияТоваровУслуг.ДоговорКонтрагента.Наименование ПОДОБНО ""%*%""
	|"+?(СписокМенеджеров.Количество()>0, " И РеализацияТоваровУслуг.Ответственный в (&СписокМенеджеров) ","")+"
	|	И РеализацияТоваровУслуг.Проведен
	//|	И (НЕ СчетФактураВыданный.ПометкаУдаления)
	//|	И СчетФактураВыданный.Дата >= &НачДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Номер
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Если Флажок1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И НЕ РеализацияТоваровУслуг.Номер ПОДОБНО &ПризнакПени","И РеализацияТоваровУслуг.Номер ПОДОБНО &ПризнакПени");
	КонецЕсли;
	Запрос.УстановитьПараметр("НачДата",НачДата);
	Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));   
	Запрос.УстановитьПараметр("СписокМенеджеров",СписокМенеджеров);
	Запрос.УстановитьПараметр("ПризнакПени","%ПЕ%"); 
	
	//|" +?(НЕ ВсеРеализации, " И не (РеализацияТоваровУслуг.ДоговорКонтрагента.Наименование Подобно ""%*%"") ","")+"
	
	
	//Выборка=Запрос.Выполнить().Выбрать();
	//  Пока Выборка.Следующий() Цикл
	// 	 СтрокаРеализация=Реализации.Добавить();	
	// 	 ЗаполнитьЗначенияСвойств(СтрокаРеализация,Выборка);
	//  КонецЦикла;	 
	Реализации.Очистить();
	Реализации.Загрузить( Запрос.Выполнить().Выгрузить() );
	//Реализации = Запрос.Выполнить().Выгрузить(); // ТабЗнач
	
	//ИмяФайлаСообщения=Выборка.Ссылка.Номер+".xls";
	//	  ДокументОбъект=Выборка.Ссылка.ПолучитьОбъект();
	//	  ТабличныйДокументОбъект=ДокументОбъект.ПечатьДокумента();
	//	  ТабличныйДокументОбъект.Записать("d:\Рассылка\"+ИмяФайлаСообщения,ТипФайлаТабличногоДокумента.XLS);
КонецПроцедуры

Процедура ПриОткрытииКлиент() Экспорт
Если НачДата=Дата(1,1,1) тогда
		НачДата=НачалоДня(НачалоДня(ТекущаяДата())-1);
	КонецЕсли;
	Если КонДата=Дата(1,1,1) тогда
		КонДата=НачалоДня(ТекущаяДата())-1;
	КонецЕсли;
	Если НЕ Флажок1 и НЕ Флажок1 тогда
		Флажок2 = Истина;
		Флажок3 = Истина;
	КонецЕсли;
	
	Если КаталогВременныхФайлов = "" тогда
		КаталогВременныхФайлов =КаталогВременныхФайлов();
		//КаталогВременныхФайлов =стрЗаменить(КаталогВременныхФайлов,"Local Settings\Temp\","Мои документы\");
	КонецЕсли;
	
	УЗнаименование = "no-reply@yst76.ru";
	УЗпароль = ",tpjndtnf";
	
	
	//---------------------------------
	
	Если СокрЛП(ТекстСообщения) = "" тогда 
		ТекстСообщения = ТекстСообщения0;
		Если СписокМенеджеров.Количество()=1 тогда
			ТекстСообщения = стрЗаменить(ТекстСообщения, "С уважением,", "С уважением,
			|"+строка(СписокМенеджеров[0].Значение) );
		КонецЕсли;					 
	КонецЕсли;
	
	ВсеРеализации = Истина;
КонецПроцедуры

Процедура ОтправитьКлиент() Экспорт
	Если НЕ Флажок1 и НЕ Флажок2 тогда
		сигнал();
		Предупреждение("Выберите что отправлять - Накладную и/или Счет", 30);
		возврат;
	КонецЕсли;	
	
	
	СписокКонтрагентов=Новый СписокЗначений;
	СписокФайловВложений=Новый СписокЗначений;
	Для каждого СТрокаКонтрагент ИЗ АдресаКонтрагентов Цикл
		Если СТрокаКонтрагент.ТребуетсяОтправкаПоПочте И СтрДлина(СокрЛП(СТрокаКонтрагент.ЭлектронныйАдрес))>0 Тогда
			СписокКонтрагентов.Добавить(СТрокаКонтрагент.Контрагент,СТрокаКонтрагент.ЭлектронныйАдрес);
		иначе
			СТрокаКонтрагент.ТребуетсяОтправкаПоПочте = ложь; //нельзя отправить на пустой адрес
		КОнецЕсли;	
	КонецЦикла;	
	
	Если СписокКОнтрагентов.Количество()>0 тогда
		Если Вопрос("Вы действительно хотите отправить электронные письма 
				    |для "+строка(СписокКОнтрагентов.Количество())+" выбранных Контрагентов?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет тогда
			Возврат;
		КонецЕсли;	
	иначе
		сигнал();
		Предупреждение("Выберите Контрагентов, у которых есть эл.адрес!
						|   Отправка писем отменена!", 30);
		возврат;
	КонецЕсли;
	
	
//--------------------------------------------------------------------------	
	//Запрос=Новый Запрос;
	// Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//			  |	Истина как Выбран,
	//			  |	РеализацияТоваровУслуг.Контрагент,
	//			  |	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	//			  |	СчетФактураВыданный.Ссылка КАК СчетФактура
	//			  |ИЗ
	//			  |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//			  |		"+?(ВсеРеализации, "ЛЕВОЕ", "Полное")+" СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//			  |		ПО РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование
	//			  |ГДЕ
	//			  |	РеализацияТоваровУслуг.Дата МЕЖДУ &НачДата И &КонДата
	//			  |"+?(СписокМенеджеров.Количество()>0, " И РеализацияТоваровУслуг.Ответственный в (&СписокМенеджеров) ","")+"
	//		 	  |	И РеализацияТоваровУслуг.Проведен
	//			  |	И РеализацияТоваровУслуг.Контрагент В(&СписокКОнтрагентов)
	//			  //|	И (НЕ СчетФактураВыданный.ПометкаУдаления)
	//			  //|	И СчетФактураВыданный.Дата >= &НачДата
	//			  |
	//			  |УПОРЯДОЧИТЬ ПО
	//			  |	РеализацияТоваровУслуг.Дата,
	//			  |	Реализация
	//			  |АВТОУПОРЯДОЧИВАНИЕ";
	//			  
	//		  
	// Запрос.УстановитьПараметр("НачДата",НачДата);
	// Запрос.УстановитьПараметр("КонДата",КонецДня(КонДата));
	// Запрос.УстановитьПараметр("СписокКОнтрагентов",СписокКОнтрагентов);
	//  Выборка=Запрос.Выполнить().Выбрать();
	
	//!!! Выборка = Реализации;
	  
//========================Проверим уч.запись======================
	  глТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	  //УЗ =  //УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь,"ОсновнаяУчетнаяЗапись");
	  
  //УЗнаименование = "";
  

		Если НЕ ЗначениеЗаполнено(УЗнаименование) тогда
			    УЗнаименование = "no-reply@yst76.ru";
				УЗпароль = ",tpjndtnf";  //безответа
			Иначе
				если 	УЗнаименование = "1c@yst.ru" тогда
				УЗпароль = "cegthvfrc";                       
				иначе
			  //ВвестиСтроку(УЗпароль, "Введите пароль для: "+СокрЛП(УЗнаименование),40);
				КонецЕсли;
		КонецЕсли;
		
		
	  //-----------------проверим папку временных файлов-----------------------
	  Состояние("Идет отправка писем...");  i=0;
	  ВременнаяПапка = КаталогВременныхФайлов;   //"C:\"; // "D:\Рассылка\";
	  
	  файлПроверки = новый файл(ВременнаяПапка);
	  Если НЕ файлПроверки.Существует() тогда
	  	КаталогВременныхФайлов = КаталогВременныхФайлов();
	  	//КаталогВременныхФайлов =стрЗаменить(КаталогВременныхФайлов,"Local Settings\Temp\","Мои документы\");
        ВременнаяПапка = КаталогВременныхФайлов;   
	  КонецЕсли;	

	  
	  //===========================================================================
	  Сообщить(" ");  i=0; 	  
	  Сообщить(">>>>> "+Строка(ТекущаяДата())+" Начата отправка эл.писем для "+строка(СписокКОнтрагентов.Количество())+" контрагентов.");
	 Для каждого Контрагент ИЗ СписокКОнтрагентов Цикл
		   i=i+1; 	  
		 	//Выборка.Сбросить();
		  СписокФайловВложений.Очистить();
		   j=0; состояние("Идет формирование "+строка(i)+"-го письма для "+Контрагент.Значение+"...");
		   
		   для i=0 по Реализации.Количество()-1 цикл
		  //Пока Выборка.Следующий() Цикл
			Выборка = Реализации[i];  
			Если НЕ выборка.выбран тогда 
				продолжить;
			КонецЕсли;
			
			  Если Контрагент.Значение=Выборка.Контрагент Тогда
				 ДокументОбъект=Выборка.Реализация.ПолучитьОбъект();
				 
				 ТабличныйДокументОбъект = неопределено;
				 
				 //Если ЭлементыФормы.Флажок1.Значение тогда
				 //	 //Печатается 1-я форма
				 //   j=j+1;
				 //   ИмяФайлаСообщения="Накладная_"+СокрЛП(ДокументОбъект.Номер)+".xls";
				 // 	состояние("Идет формирование "+строка(j)+" файла для "+строка(Выборка.Контрагент)+": "+ИмяФайлаСообщения);
				 //   ДокументОбъект.Печать("Накладная",1, ложь, ложь, Истина, ТабличныйДокументОбъект); //Расходная Накладная
				 //   состояние("Идет Запись "+строка(j)+" файла для "+строка(Выборка.Контрагент)+": "+ИмяФайлаСообщения);
				 //   ТабличныйДокументОбъект.Записать(временнаяПапка+ИмяФайлаСообщения,ТипФайлаТабличногоДокумента.XLS);
				 // 
				 // СписокФайловВложений.Добавить(временнаяПапка+ИмяФайлаСообщения);
				 // КонецЕсли;
			  
				  //----------------СчетФактуры в ТЧ называются ЗаказПокупателя!!!-----------------------------------
				  Если Флажок2 тогда
				  //Печатается 2-я форма
				  //ДокументОбъект = Выборка.ЗаказПокупателя.ПолучитьОбъект();
				   
				   j=j+1;
					ИмяФайлаСообщения="УПД_"+СокрЛП(ДокументОбъект.Номер)+".xls";
					состояние("Идет формирование "+строка(j)+" файла для "+строка(Выборка.Контрагент)+": "+ИмяФайлаСообщения);
					
				
				//+++( 11.01.2012 "СчетФактура ЯШТ"
				//	ДокументОбъект.Печать("СчетФактура", 1, ложь, ложь, Истина, ТабличныйДокументОбъект); 
				
				обр = Справочники.ДополнительныеПечатныеФормы.НайтиПоНаименованию("ТОРГ-12 (Яршинторг).");
				Если обр = неопределено тогда
					сообщить("Не найдена дополнительная печатная форма ""ТОРГ-12 (Яршинторг).""!");
				иначе
					ИмяФайла = временнаяПапка+"PrnFormSFyst.tmp";
					ОбъектВнешнейФормы = обр.ПолучитьОбъект();
		
					ДвоичныеДанные = ОбъектВнешнейФормы.ХранилищеВнешнейОбработки.Получить();
					ДвоичныеДанные.Записать(ИмяФайла);
					//+++ Обработка
	    			Попытка
					Обработка = ВнешниеОбработки.Создать(ИмяФайла);
					Обработка.СсылкаНаОбъект = ДокументОбъект.ссылка; //Инициализировать(ДокументОбъект, "");
                    ТабличныйДокументОбъект = Обработка.ЭтотОбъект.Печать();
				
				    			
					состояние("Идет Запись "+строка(j)+" файла для "+строка(Выборка.Контрагент)+": "+ИмяФайлаСообщения);
	  				ТабличныйДокументОбъект.Записать(временнаяПапка+ИмяФайлаСообщения,ТипФайлаТабличногоДокумента.XLS);
					СписокФайловВложений.Добавить(ВременнаяПапка+ИмяФайлаСообщения);
					состояние(" ");
					Исключение
					сообщить("Ошибка при формировании УПД или записи файла "+временнаяПапка+ИмяФайлаСообщения);
					конецпопытки;
				КонецЕсли;
				//+++) 11.01.2012
				
				  ИначеЕсли Флажок2 и (не ЗначениеЗаполнено(Выборка.ЗаказПокупателя)) тогда
					 состояние(" ");
					сообщить("х х х Для реализации № "+СокрЛП(Выборка.Реализация.Номер)+" - нет УПД!", СтатусСообщения.Внимание);
					//КонецЕсли;
				  КонецЕсли;
				  
				  //+++ Плотников Торг 12
				  
		//	   Если ЭлементыФормы.Флажок3.Значение тогда
		//		  //Печатается 2-я форма
		//		  ДокументОбъект=Выборка.Реализация.ПолучитьОбъект();
		//		   
		//		   j=j+1;
		//			ИмяФайлаСообщения="Торг12_"+СокрЛП(ДокументОбъект.Номер)+".xls";
		//			состояние("Идет формирование "+строка(j)+" файла для "+строка(Выборка.Контрагент)+": "+ИмяФайлаСообщения);
		//			
		//		
		//		//+++( 11.01.2012 "СчетФактура ЯШТ"
		//		//	ДокументОбъект.Печать("СчетФактура", 1, ложь, ложь, Истина, ТабличныйДокументОбъект); 
		//		
		//		обр = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Торг-12 ЯШТ.");
		//		Если обр = неопределено тогда
		//			сообщить("Не найдена дополнительная печатная форма ""Торг-12 ЯШТ""!");
		//		иначе
		//			ИмяФайла = временнаяПапка+"PrnFormSFyst.tmp";
		//			ОбъектВнешнейФормы = обр.ПолучитьОбъект();
		//
		//			ДвоичныеДанные = ОбъектВнешнейФормы.ХранилищеВнешнейОбработки.Получить();
		//			ДвоичныеДанные.Записать(ИмяФайла);
		//			//+++ Обработка
		//			Попытка
		//			Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		//			Обработка.СсылкаНаОбъект = ДокументОбъект.ссылка; //Инициализировать(ДокументОбъект, "");
		//			ТабличныйДокументОбъект = Обработка.ЭтотОбъект.Печать();
		//		
		//						
		//			состояние("Идет Запись "+строка(j)+" файла для "+строка(Выборка.Контрагент)+": "+ИмяФайлаСообщения);
		//			ТабличныйДокументОбъект.Записать(временнаяПапка+ИмяФайлаСообщения,ТипФайлаТабличногоДокумента.XLS);
		//			СписокФайловВложений.Добавить(ВременнаяПапка+ИмяФайлаСообщения);
		//			состояние(" ");
		//			Исключение
		//			сообщить("Ошибка при формировании ТОРГ 12 или записи файла "+временнаяПапка+ИмяФайлаСообщения);
		//			конецпопытки;
		//		КонецЕсли;
		//		
		//		КонецЕсли; //Торг12
			
			 КонецЕсли;
		  
		  КонецЦикла;	 
		  
		  состояние("Идет отправка "+строка(i)+"-го письма для "+Строка(Выборка.Контрагент) );
		  ПослатьЯШТ(Контрагент.Представление,СписокФайловВложений, УЗнаименование, УЗпароль);	  
		//  Сообщить(" >>> "+строка(i)+" эл.письмо отправлено контрагенту: "+Строка(Контрагент.Значение)+" на эл.адрес: "+Контрагент.Представление+" содержит "+строка(j)+" вложенных файлов...", СтатусСообщения.Информация);	
		  
	  КонецЦикла;	 
	   
		Сообщить(">>>>> "+Строка(ТекущаяДата())+" Завершена отправка "+строка(j)+" файлов с осн.учетной записи эл.почты: "+УЗНаименование);	
		Сообщить(" ");
	 	сообщить("Все выгруженные файлы находятся во временной папке:  "+временнаяПапка);
		Сообщить(" ");
	 	
	 	Сигнал();сигнал();
		Предупреждение("Отправка "+строка(j)+" файлов завершена!");

	КонецПроцедуры
	
	Процедура ПослатьЯШТ(АдресПолучателя,СписокФайловВложений, УЗимя, УЗпароль)
	   //ТекстПисьма = ЭтаФорма.ЭлементыФормы.ПолеHTMLДокумента.ПолучитьТекст();
	    	
	    ИПП=Новый ИнтернетПочтовыйПрофиль;
		ИПП.АдресСервераSMTP= ?(Найти(УЗимя, "@yst76.ru")>0, "mail.yst76.ru", "127.0.0.1" );
		ИПП.ПортSMTP=25; 
		//Если УЗ.ТребуетсяSMTPАутентификация Тогда
			ИПП.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
			ИПП.ПользовательSMTP   = СокрЛП(УЗимя); //?(Найти(УЗимя, "@yst76.ru")=0, СокрЛП(УЗимя),);
			ИПП.ПарольSMTP         = УЗпароль;
		//Иначе
		//	ИПП.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		//	ИПП.ПарольSMTP         = "";
		//	ИПП.ПользовательSMTP   = "";
		//КонецЕсли;
		Письмо=Новый ИнтернетПочтовоеСообщение;
		Письмо.Отправитель=УЗимя;
	    //+++( 19.12.2011 - разбор адреса на несколько адресов
		i = Найти(АдресПолучателя,";"); j=Найти(АдресПолучателя, ",");
		k=?(i>0 и i>j,  i, ?(j>0 и j>i, j, 0) );
			
		Если i=0 и j=0 тогда
			Письмо.Получатели.Добавить(АдресПолучателя);
		иначе
			АдрОстаток = СокрЛП(АдресПолучателя);
			пока (k>0) цикл
				Адр1 = Лев(АдрОстаток, k-1);
				Если СокрЛП(Адр1)<>"" и Найти(Адр1,"@")>0 и Найти(Адр1,".")>0 тогда
					Письмо.Получатели.Добавить(СокрЛП(Адр1));
				КонецЕсли;
				АдрОстаток = Прав(АдрОстаток, стрДлина(АдрОстаток)-k);
				i = Найти(АдрОстаток,";"); j=Найти(АдрОстаток, ",");
				k=?(i>0 и i>j,  i, ?(j>0 и j>i, j, 0) );
			КонецЦикла;
			Если СокрЛП(АдрОстаток)<>"" и Найти(АдрОстаток,"@")>0 и Найти(АдрОстаток,".")>0 тогда
				Письмо.Получатели.Добавить(СокрЛП(АдрОстаток));
			КонецЕсли;

		КонецЕсли; //+++ )

		Если ЗначениеЗаполнено(СписокФайловВложений) И СписокФайловВложений.Количество()>0 Тогда
			Для Каждого ТекАдр Из СписокФайловВложений Цикл
				Письмо.Вложения.Добавить(ТекАдр.Значение);
			КонецЦикла;
		КонецЕсли;
        Письмо.Тема="Документы от ЗАО ТК ""Яршинторг"" "+?(КонДата=НачДата, "за "+Формат(НачДата,"ДЛФ=D"), " c "+Формат(НачДата,"ДЛФ=D")+" по "+Формат(КонДата,"ДЛФ=D") );
		Письмо.ИмяОтправителя ="ЗАО ТК ""Яршинторг"", г.Ярославль";
	    Письмо.Организация ="ЗАО ТК ""Яршинторг"", г.Ярославль";
	    Письмо.Тексты.Добавить(СокрЛП(ТекстСообщения),ТипТекстаПочтовогоСообщения.простойТекст);
		
		Почта=Новый ИнтернетПочта;
		попытка
			Почта.Подключиться(ИПП);
	    	Почта.Послать(Письмо);
	    	Почта.Отключиться();
			сообщить(" >>>  Письмо отправлено на эл.адрес: "+АдресПолучателя+". "+строка(СписокФайловВложений.Количество())+" вложенных файлов...", СтатусСообщения.Информация);
		исключение
			сообщить("xxxxx Ошибка при отправке письма на эл.адрес: "+АдресПолучателя+" - "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		конецПопытки;
КонецПроцедуры


  ТекстСообщения0 ="   Добрый день,
						 |
						 |Высылаем Вам копии документов.
						 |
						 |
						 |С уважением, 
						 |ЗАО Торговая Компания ""Яршинторг"", 
						 |юр./факт.адрес: 150044, Ярославская обл, Ярославль г, Базовая ул, дом № 3
						 |тел./факс: (4852) 200-200, 67-11-67
						 |Web-сайт : http://www.yst.ru
						 |";
